[NoCoverage] ArrowFunction
src/App.vue:5:25
 import { computed, watch } from 'vue'
 import HomeView from './HomeView.vue'
 
-const height = computed(() => window.innerHeight)
+const height = computed(() => undefined)
 const width = computed(() => window.innerWidth)
 

[NoCoverage] ArrowFunction
src/App.vue:6:24
 import HomeView from './HomeView.vue'
 
 const height = computed(() => window.innerHeight)
-const width = computed(() => window.innerWidth)
+const width = computed(() => undefined)
 
 watch(height, () => {

[NoCoverage] BlockStatement
src/App.vue:8:21
 const height = computed(() => window.innerHeight)
 const width = computed(() => window.innerWidth)
 
-watch(height, () => {
-  console.log('height change')
-})
+watch(height, () => {})
 watch(width, () => {
   console.log('width change')

[NoCoverage] BlockStatement
src/App.vue:11:20
 watch(height, () => {
   console.log('height change')
 })
-watch(width, () => {
-  console.log('width change')
-})
+watch(width, () => {})
 </script>
 

[NoCoverage] StringLiteral
src/App.vue:12:15
   console.log('height change')
 })
 watch(width, () => {
-  console.log('width change')
+  console.log("")
 })
 </script>
