[NoCoverage] BlockStatement
src/HomeView.vue:26:53
 const { flock, addBird, clearAllIntervals } = useBirds(props.height, props.width)
 const count = ref(0)
 
-window.addEventListener('click', (e: MouseEvent) => {
-  addBird({ x: e.x, y: props.height - e.y })
-})
+window.addEventListener('click', (e: MouseEvent) => {})
 
 const clouds = Array(10)

[NoCoverage] StringLiteral
src/HomeView.vue:26:25
 const { flock, addBird, clearAllIntervals } = useBirds(props.height, props.width)
 const count = ref(0)
 
-window.addEventListener('click', (e: MouseEvent) => {
+window.addEventListener("", (e: MouseEvent) => {
   addBird({ x: e.x, y: props.height - e.y })
 })

[NoCoverage] ArithmeticOperator
src/HomeView.vue:27:24
 const count = ref(0)
 
 window.addEventListener('click', (e: MouseEvent) => {
-  addBird({ x: e.x, y: props.height - e.y })
+  addBird({ x: e.x, y: props.height + e.y })
 })
 

[NoCoverage] ArrowFunction
src/HomeView.vue:32:8
 
 const clouds = Array(10)
   .fill('')
-  .map(() => ({
-    class: 'cloud ' + (Math.random() < 0.3 ? 'small' : Math.random() > 0.5 ? 'large' : ''),
-    style: { top: Math.random() * 50 + '%', left: Math.random() * 80 + '%' }
-  }))
+  .map(() => undefined)
 
 onMounted(() => {

[NoCoverage] ObjectLiteral
src/HomeView.vue:32:15
 
 const clouds = Array(10)
   .fill('')
-  .map(() => ({
-    class: 'cloud ' + (Math.random() < 0.3 ? 'small' : Math.random() > 0.5 ? 'large' : ''),
-    style: { top: Math.random() * 50 + '%', left: Math.random() * 80 + '%' }
-  }))
+  .map(() => ({}))
 
 onMounted(() => {

[NoCoverage] EqualityOperator
src/HomeView.vue:33:56
 const clouds = Array(10)
   .fill('')
   .map(() => ({
-    class: 'cloud ' + (Math.random() < 0.3 ? 'small' : Math.random() > 0.5 ? 'large' : ''),
+    class: 'cloud ' + (Math.random() < 0.3 ? 'small' : Math.random() >= 0.5 ? 'large' : ''),
     style: { top: Math.random() * 50 + '%', left: Math.random() * 80 + '%' }
   }))

[NoCoverage] ConditionalExpression
src/HomeView.vue:33:24
 const clouds = Array(10)
   .fill('')
   .map(() => ({
-    class: 'cloud ' + (Math.random() < 0.3 ? 'small' : Math.random() > 0.5 ? 'large' : ''),
+    class: 'cloud ' + (true ? 'small' : Math.random() > 0.5 ? 'large' : ''),
     style: { top: Math.random() * 50 + '%', left: Math.random() * 80 + '%' }
   }))

[NoCoverage] ArithmeticOperator
src/HomeView.vue:34:19
   .fill('')
   .map(() => ({
     class: 'cloud ' + (Math.random() < 0.3 ? 'small' : Math.random() > 0.5 ? 'large' : ''),
-    style: { top: Math.random() * 50 + '%', left: Math.random() * 80 + '%' }
+    style: { top: Math.random() / 50 + '%', left: Math.random() * 80 + '%' }
   }))
 

[NoCoverage] ArithmeticOperator
src/HomeView.vue:34:51
   .fill('')
   .map(() => ({
     class: 'cloud ' + (Math.random() < 0.3 ? 'small' : Math.random() > 0.5 ? 'large' : ''),
-    style: { top: Math.random() * 50 + '%', left: Math.random() * 80 + '%' }
+    style: { top: Math.random() * 50 + '%', left: Math.random() / 80 + '%' }
   }))
 

[NoCoverage] BlockStatement
src/HomeView.vue:37:17
     style: { top: Math.random() * 50 + '%', left: Math.random() * 80 + '%' }
   }))
 
-onMounted(() => {
-  addBird()
-  addBird()
-  //FIXME hacky way to update DOM
-  setInterval(() => {
-    count.value++
-  }, 100)
-})
+onMounted(() => {})
 
 onBeforeUnmount(() => {

[NoCoverage] BlockStatement
src/HomeView.vue:41:21
   addBird()
   addBird()
   //FIXME hacky way to update DOM
-  setInterval(() => {
-    count.value++
-  }, 100)
+  setInterval(() => {}, 100)
 })
 

[NoCoverage] UpdateOperator
src/HomeView.vue:42:5
   addBird()
   //FIXME hacky way to update DOM
   setInterval(() => {
-    count.value++
+    count.value--
   }, 100)
 })

[NoCoverage] BlockStatement
src/HomeView.vue:46:23
   }, 100)
 })
 
-onBeforeUnmount(() => {
-  clearAllIntervals()
-})
+onBeforeUnmount(() => {})
 </script>
 
