[NoCoverage] BlockStatement
src/components/BirdComponent.vue:11:34
 
 const props = defineProps<{ positionX: number; positionY: number; direction: Direction }>()
 
-const birdStyle = computed(() => {
-  return {
-    transform: `rotate(${-props.direction}deg)`,
-    bottom: `${props.positionY}px`,
-    left: `${props.positionX}px`
-  }
-})
+const birdStyle = computed(() => {})
 </script>
 

[NoCoverage] UnaryOperator
src/components/BirdComponent.vue:13:26
 
 const birdStyle = computed(() => {
   return {
-    transform: `rotate(${-props.direction}deg)`,
+    transform: `rotate(${+props.direction}deg)`,
     bottom: `${props.positionY}px`,
     left: `${props.positionX}px`

[NoCoverage] StringLiteral
src/components/BirdComponent.vue:14:13
 const birdStyle = computed(() => {
   return {
     transform: `rotate(${-props.direction}deg)`,
-    bottom: `${props.positionY}px`,
+    bottom: ``,
     left: `${props.positionX}px`
   }

[NoCoverage] StringLiteral
src/components/BirdComponent.vue:15:11
   return {
     transform: `rotate(${-props.direction}deg)`,
     bottom: `${props.positionY}px`,
-    left: `${props.positionX}px`
+    left: ``
   }
 })
