[Killed] ObjectLiteral
src/composables/useBirds.ts:19:33
   padding: boolean
 }
 export const useBirds = (height: number, width: number, params?: Params) => {
-  const flock = reactive<Flock>({ birds: [] })
+  const flock = reactive<Flock>({})
   const intervals = ref<any[]>([])
   const {
killedBy: useBirds moveBird should move bird north
statusReason: Cannot read properties of undefined (reading 'find')

[Survived] ArrayDeclaration
src/composables/useBirds.ts:20:32
 }
 export const useBirds = (height: number, width: number, params?: Params) => {
   const flock = reactive<Flock>({ birds: [] })
-  const intervals = ref<any[]>([])
+  const intervals = ref<any[]>(["Stryker was here"])
   const {
     distance_increment,

[Survived] BooleanLiteral
src/composables/useBirds.ts:32:14
     rotation_increment: 90,
     time_increment: 200,
     nb_of_significant_neighbors: 10,
-    padding: true,
+    padding: false,
     ...params
   }

[Killed] BlockStatement
src/composables/useBirds.ts:36:54
     ...params
   }
 
-  const moveBird = (bird: Bird, distance: number) => {
-    const { x, y } = calculateNextPosition(
-      bird.position.x,
-      bird.position.y,
-      bird.direction,
-      distance
-    )
-    const alreadySomeoneThere = !!flock.birds.find((b) => b.position.x === x && b.position.y === y)
-    const padding_distance = padding ? distance * 2 : 0
-    const outside =
-      x < padding_distance ||
-      y < padding_distance ||
-      x >= width - padding_distance ||
-      y >= height - padding_distance
-    if (!alreadySomeoneThere && !outside) {
-      bird.position.x = x
-      bird.position.y = y
-      const neighbourDirection = averageDirection(
-        findNearestBirds(bird, flock, NB_OF_SIGNIFICANT_NEIGHBORS)
-      )
-      bird.direction = neighbourDirection + (45 - Math.floor(Math.random() * 90))
-    } else {
-      bird.direction = bird.direction + ROTATION_INCREMENT
-    }
-  }
+  const moveBird = (bird: Bird, distance: number) => {}
 
   const setBirdMovingInterval = (bird: Bird) => {
killedBy: useBirds moveBird should move bird north
statusReason: expected { x: +0, y: +0 } to strictly equal { x: +0, y: 1 }

[Killed] BooleanLiteral
src/composables/useBirds.ts:43:34
       bird.direction,
       distance
     )
-    const alreadySomeoneThere = !!flock.birds.find((b) => b.position.x === x && b.position.y === y)
+    const alreadySomeoneThere = !flock.birds.find(b => b.position.x === x && b.position.y === y)
     const padding_distance = padding ? distance * 2 : 0
     const outside =
killedBy: useBirds moveBird should move bird north
statusReason: expected { x: +0, y: +0 } to strictly equal { x: +0, y: 1 }

[NoCoverage] ArithmeticOperator
src/composables/useBirds.ts:44:40
       distance
     )
     const alreadySomeoneThere = !!flock.birds.find((b) => b.position.x === x && b.position.y === y)
-    const padding_distance = padding ? distance * 2 : 0
+    const padding_distance = padding ? distance / 2 : 0
     const outside =
       x < padding_distance ||

[Killed] EqualityOperator
src/composables/useBirds.ts:46:7
     const alreadySomeoneThere = !!flock.birds.find((b) => b.position.x === x && b.position.y === y)
     const padding_distance = padding ? distance * 2 : 0
     const outside =
-      x < padding_distance ||
+      x <= padding_distance ||
       y < padding_distance ||
       x >= width - padding_distance ||
killedBy: useBirds moveBird should move bird north
statusReason: expected { x: +0, y: +0 } to strictly equal { x: +0, y: 1 }

[Killed] EqualityOperator
src/composables/useBirds.ts:46:7
     const alreadySomeoneThere = !!flock.birds.find((b) => b.position.x === x && b.position.y === y)
     const padding_distance = padding ? distance * 2 : 0
     const outside =
-      x < padding_distance ||
+      x >= padding_distance ||
       y < padding_distance ||
       x >= width - padding_distance ||
killedBy: useBirds moveBird should move bird north
statusReason: expected { x: +0, y: +0 } to strictly equal { x: +0, y: 1 }

[Killed] EqualityOperator
src/composables/useBirds.ts:47:7
     const padding_distance = padding ? distance * 2 : 0
     const outside =
       x < padding_distance ||
-      y < padding_distance ||
+      y >= padding_distance ||
       x >= width - padding_distance ||
       y >= height - padding_distance
killedBy: useBirds moveBird should move bird north
statusReason: expected { x: +0, y: +0 } to strictly equal { x: +0, y: 1 }

[Survived] EqualityOperator
src/composables/useBirds.ts:47:7
     const padding_distance = padding ? distance * 2 : 0
     const outside =
       x < padding_distance ||
-      y < padding_distance ||
+      y <= padding_distance ||
       x >= width - padding_distance ||
       y >= height - padding_distance

[Killed] EqualityOperator
src/composables/useBirds.ts:48:7
     const outside =
       x < padding_distance ||
       y < padding_distance ||
-      x >= width - padding_distance ||
+      x < width - padding_distance ||
       y >= height - padding_distance
     if (!alreadySomeoneThere && !outside) {
killedBy: useBirds moveBird should move bird north
statusReason: expected { x: +0, y: +0 } to strictly equal { x: +0, y: 1 }

[Survived] ConditionalExpression
src/composables/useBirds.ts:48:7
     const outside =
       x < padding_distance ||
       y < padding_distance ||
-      x >= width - padding_distance ||
+      false ||
       y >= height - padding_distance
     if (!alreadySomeoneThere && !outside) {

[Killed] EqualityOperator
src/composables/useBirds.ts:49:7
       x < padding_distance ||
       y < padding_distance ||
       x >= width - padding_distance ||
-      y >= height - padding_distance
+      y > height - padding_distance
     if (!alreadySomeoneThere && !outside) {
       bird.position.x = x
killedBy: useBirds moveBird should not move bird bc it is at the end of window
statusReason: expected { x: 1, y: 2 } to strictly equal { x: 1, y: 1 }

[Killed] ConditionalExpression
src/composables/useBirds.ts:49:7
       x < padding_distance ||
       y < padding_distance ||
       x >= width - padding_distance ||
-      y >= height - padding_distance
+      false
     if (!alreadySomeoneThere && !outside) {
       bird.position.x = x
killedBy: useBirds moveBird should not move bird bc it is at the end of window
statusReason: expected { x: 1, y: 2 } to strictly equal { x: 1, y: 1 }

[Killed] ConditionalExpression
src/composables/useBirds.ts:50:9
       y < padding_distance ||
       x >= width - padding_distance ||
       y >= height - padding_distance
-    if (!alreadySomeoneThere && !outside) {
+    if (false) {
       bird.position.x = x
       bird.position.y = y
killedBy: useBirds moveBird should move bird north
statusReason: expected { x: +0, y: +0 } to strictly equal { x: +0, y: 1 }

[Killed] ConditionalExpression
src/composables/useBirds.ts:50:9
       y < padding_distance ||
       x >= width - padding_distance ||
       y >= height - padding_distance
-    if (!alreadySomeoneThere && !outside) {
+    if (true) {
       bird.position.x = x
       bird.position.y = y
killedBy: useBirds moveBird should not move bird bc it is at the end of window
statusReason: expected { x: 1, y: 2 } to strictly equal { x: 1, y: 1 }

[Survived] ArithmeticOperator
src/composables/useBirds.ts:56:46
       const neighbourDirection = averageDirection(
         findNearestBirds(bird, flock, NB_OF_SIGNIFICANT_NEIGHBORS)
       )
-      bird.direction = neighbourDirection + (45 - Math.floor(Math.random() * 90))
+      bird.direction = neighbourDirection + (45 + Math.floor(Math.random() * 90))
     } else {
       bird.direction = bird.direction + ROTATION_INCREMENT

[Survived] ArithmeticOperator
src/composables/useBirds.ts:56:62
       const neighbourDirection = averageDirection(
         findNearestBirds(bird, flock, NB_OF_SIGNIFICANT_NEIGHBORS)
       )
-      bird.direction = neighbourDirection + (45 - Math.floor(Math.random() * 90))
+      bird.direction = neighbourDirection + (45 - Math.floor(Math.random() / 90))
     } else {
       bird.direction = bird.direction + ROTATION_INCREMENT

[Survived] BlockStatement
src/composables/useBirds.ts:57:12
         findNearestBirds(bird, flock, NB_OF_SIGNIFICANT_NEIGHBORS)
       )
       bird.direction = neighbourDirection + (45 - Math.floor(Math.random() * 90))
-    } else {
-      bird.direction = bird.direction + ROTATION_INCREMENT
-    }
+    } else {}
   }
 

[Survived] ArithmeticOperator
src/composables/useBirds.ts:58:24
       )
       bird.direction = neighbourDirection + (45 - Math.floor(Math.random() * 90))
     } else {
-      bird.direction = bird.direction + ROTATION_INCREMENT
+      bird.direction = bird.direction - ROTATION_INCREMENT
     }
   }

[NoCoverage] BlockStatement
src/composables/useBirds.ts:62:49
     }
   }
 
-  const setBirdMovingInterval = (bird: Bird) => {
-    const intervalId = setInterval(
-      () => moveBird(bird, DISTANCE_INCREMENT),
-      TIME_INCREMENT - Math.floor((Math.random() * TIME_INCREMENT) / 2)
-    )
-    intervals.value.push(intervalId)
-    return intervalId
-  }
+  const setBirdMovingInterval = (bird: Bird) => {}
 
   const clearAllIntervals = () => {

[NoCoverage] ArrowFunction
src/composables/useBirds.ts:64:7
 
   const setBirdMovingInterval = (bird: Bird) => {
     const intervalId = setInterval(
-      () => moveBird(bird, DISTANCE_INCREMENT),
+      () => undefined,
       TIME_INCREMENT - Math.floor((Math.random() * TIME_INCREMENT) / 2)
     )

[NoCoverage] ArithmeticOperator
src/composables/useBirds.ts:65:35
   const setBirdMovingInterval = (bird: Bird) => {
     const intervalId = setInterval(
       () => moveBird(bird, DISTANCE_INCREMENT),
-      TIME_INCREMENT - Math.floor((Math.random() * TIME_INCREMENT) / 2)
+      TIME_INCREMENT - Math.floor(Math.random() * TIME_INCREMENT * 2)
     )
     intervals.value.push(intervalId)

[NoCoverage] ArithmeticOperator
src/composables/useBirds.ts:65:7
   const setBirdMovingInterval = (bird: Bird) => {
     const intervalId = setInterval(
       () => moveBird(bird, DISTANCE_INCREMENT),
-      TIME_INCREMENT - Math.floor((Math.random() * TIME_INCREMENT) / 2)
+      TIME_INCREMENT + Math.floor(Math.random() * TIME_INCREMENT / 2)
     )
     intervals.value.push(intervalId)

[NoCoverage] BlockStatement
src/composables/useBirds.ts:71:35
     return intervalId
   }
 
-  const clearAllIntervals = () => {
-    intervals.value.forEach((interval) => {
-      clearInterval(interval)
-    })
-  }
+  const clearAllIntervals = () => {}
 
   const addBird = (

[NoCoverage] BlockStatement
src/composables/useBirds.ts:72:43
   }
 
   const clearAllIntervals = () => {
-    intervals.value.forEach((interval) => {
-      clearInterval(interval)
-    })
+    intervals.value.forEach((interval) => {})
   }
 

[NoCoverage] ArithmeticOperator
src/composables/useBirds.ts:78:55
   }
 
   const addBird = (
-    startingPosition: { x: number; y: number } = { x: width / 2, y: height / 2 }
+    startingPosition: { x: number; y: number } = { x: width * 2, y: height / 2 }
   ) => {
     const newBird = {

[NoCoverage] ArithmeticOperator
src/composables/useBirds.ts:78:69
   }
 
   const addBird = (
-    startingPosition: { x: number; y: number } = { x: width / 2, y: height / 2 }
+    startingPosition: { x: number; y: number } = { x: width / 2, y: height * 2 }
   ) => {
     const newBird = {

[NoCoverage] BlockStatement
src/composables/useBirds.ts:79:8
 
   const addBird = (
     startingPosition: { x: number; y: number } = { x: width / 2, y: height / 2 }
-  ) => {
-    const newBird = {
-      id: uuidv4(),
-      position: startingPosition,
-      direction: Math.round(Math.random() * 360)
-    }
-    flock.birds.push(newBird)
-    setBirdMovingInterval(newBird)
-  }
+  ) => {}
 
   return {

[NoCoverage] ObjectLiteral
src/composables/useBirds.ts:80:21
   const addBird = (
     startingPosition: { x: number; y: number } = { x: width / 2, y: height / 2 }
   ) => {
-    const newBird = {
-      id: uuidv4(),
-      position: startingPosition,
-      direction: Math.round(Math.random() * 360)
-    }
+    const newBird = {}
     flock.birds.push(newBird)
     setBirdMovingInterval(newBird)

[NoCoverage] ArithmeticOperator
src/composables/useBirds.ts:83:29
     const newBird = {
       id: uuidv4(),
       position: startingPosition,
-      direction: Math.round(Math.random() * 360)
+      direction: Math.round(Math.random() / 360)
     }
     flock.birds.push(newBird)
