[Killed] BlockStatement
src/composables/position.helper.ts:8:3
   currentY: number,
   direction: number,
   distance: number
-) {
-  const radians = (direction * Math.PI) / 180
-
-  const x = currentX + distance * Math.round(Math.cos(radians))
-  const y = currentY + distance * Math.round(Math.sin(radians))
-
-  return { x, y }
-}
+) {}
 
 export function findNearestBirds(bird: Bird, flock: Flock, limit = 5): Bird[] {
killedBy: position.helper calculateNextPosition move to 0 -> (x:1, y:0)
statusReason: expected undefined to strictly equal { x: 1, y: +0 }

[Killed] ArithmeticOperator
src/composables/position.helper.ts:9:20
   direction: number,
   distance: number
 ) {
-  const radians = (direction * Math.PI) / 180
+  const radians = (direction / Math.PI) / 180
 
   const x = currentX + distance * Math.round(Math.cos(radians))
killedBy: position.helper calculateNextPosition move to 90 -> (x:0, y:1)
statusReason: expected { x: 1, y: +0 } to strictly equal { x: +0, y: 1 }

[Killed] ArithmeticOperator
src/composables/position.helper.ts:9:19
   direction: number,
   distance: number
 ) {
-  const radians = (direction * Math.PI) / 180
+  const radians = direction * Math.PI * 180
 
   const x = currentX + distance * Math.round(Math.cos(radians))
killedBy: position.helper calculateNextPosition move to 90 -> (x:0, y:1)
statusReason: expected { x: 1, y: +0 } to strictly equal { x: +0, y: 1 }

[Killed] ArithmeticOperator
src/composables/position.helper.ts:11:24
 ) {
   const radians = (direction * Math.PI) / 180
 
-  const x = currentX + distance * Math.round(Math.cos(radians))
+  const x = currentX + distance / Math.round(Math.cos(radians))
   const y = currentY + distance * Math.round(Math.sin(radians))
 
killedBy: position.helper calculateNextPosition move to 90 -> (x:0, y:1)
statusReason: expected { x: Infinity, y: 1 } to strictly equal { x: +0, y: 1 }

[Killed] ArithmeticOperator
src/composables/position.helper.ts:11:13
 ) {
   const radians = (direction * Math.PI) / 180
 
-  const x = currentX + distance * Math.round(Math.cos(radians))
+  const x = currentX - distance * Math.round(Math.cos(radians))
   const y = currentY + distance * Math.round(Math.sin(radians))
 
killedBy: position.helper calculateNextPosition move to 0 -> (x:1, y:0)
statusReason: expected { x: -1, y: +0 } to strictly equal { x: 1, y: +0 }

[Killed] ArithmeticOperator
src/composables/position.helper.ts:12:24
   const radians = (direction * Math.PI) / 180
 
   const x = currentX + distance * Math.round(Math.cos(radians))
-  const y = currentY + distance * Math.round(Math.sin(radians))
+  const y = currentY + distance / Math.round(Math.sin(radians))
 
   return { x, y }
killedBy: position.helper calculateNextPosition move to 0 -> (x:1, y:0)
statusReason: expected { x: 1, y: Infinity } to strictly equal { x: 1, y: +0 }

[Killed] ArithmeticOperator
src/composables/position.helper.ts:12:13
   const radians = (direction * Math.PI) / 180
 
   const x = currentX + distance * Math.round(Math.cos(radians))
-  const y = currentY + distance * Math.round(Math.sin(radians))
+  const y = currentY - distance * Math.round(Math.sin(radians))
 
   return { x, y }
killedBy: position.helper calculateNextPosition move to 90 -> (x:0, y:1)
statusReason: expected { x: +0, y: -1 } to strictly equal { x: +0, y: 1 }

[Killed] BlockStatement
src/composables/position.helper.ts:17:79
   return { x, y }
 }
 
-export function findNearestBirds(bird: Bird, flock: Flock, limit = 5): Bird[] {
-  return flock.birds
-    .map((flockBird) => ({
-      ...flockBird,
-      distanceBetweenBirds: Math.sqrt(
-        Math.pow(bird.position.x - flockBird.position.x, 2) +
-          Math.pow(bird.position.y - flockBird.position.y, 2)
-      )
-    }))
-    .sort((a, b) => (a.distanceBetweenBirds < b.distanceBetweenBirds ? -1 : 1))
-    .slice(0, limit)
-}
+export function findNearestBirds(bird: Bird, flock: Flock, limit = 5): Bird[] {}
 
 export function averageDirection(birds: Bird[]): number {
killedBy: position.helper findNearestBird find nearest birds
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] MethodExpression
src/composables/position.helper.ts:18:10
 }
 
 export function findNearestBirds(bird: Bird, flock: Flock, limit = 5): Bird[] {
-  return flock.birds
-    .map((flockBird) => ({
-      ...flockBird,
-      distanceBetweenBirds: Math.sqrt(
-        Math.pow(bird.position.x - flockBird.position.x, 2) +
-          Math.pow(bird.position.y - flockBird.position.y, 2)
-      )
-    }))
-    .sort((a, b) => (a.distanceBetweenBirds < b.distanceBetweenBirds ? -1 : 1))
-    .slice(0, limit)
+  return flock.birds.map(flockBird => ({
+  ...flockBird,
+  distanceBetweenBirds: Math.sqrt(Math.pow(bird.position.x - flockBird.position.x, 2) + Math.pow(bird.position.y - flockBird.position.y, 2))
+})).sort((a, b) => a.distanceBetweenBirds < b.distanceBetweenBirds ? -1 : 1)
 }
 
killedBy: position.helper findNearestBird find nearest birds
statusReason: expected [ '1', '3', '4', '2' ] to strictly equal [ '1', '3' ]

[Killed] MethodExpression
src/composables/position.helper.ts:18:10
 }
 
 export function findNearestBirds(bird: Bird, flock: Flock, limit = 5): Bird[] {
-  return flock.birds
-    .map((flockBird) => ({
-      ...flockBird,
-      distanceBetweenBirds: Math.sqrt(
-        Math.pow(bird.position.x - flockBird.position.x, 2) +
-          Math.pow(bird.position.y - flockBird.position.y, 2)
-      )
-    }))
-    .sort((a, b) => (a.distanceBetweenBirds < b.distanceBetweenBirds ? -1 : 1))
+  return flock.birds.map(flockBird => ({
+  ...flockBird,
+  distanceBetweenBirds: Math.sqrt(Math.pow(bird.position.x - flockBird.position.x, 2) + Math.pow(bird.position.y - flockBird.position.y, 2))
+}))
     .slice(0, limit)
 }
killedBy: position.helper findNearestBird find nearest birds
statusReason: expected [ '1', '2' ] to strictly equal [ '1', '3' ]

[Killed] ArrowFunction
src/composables/position.helper.ts:19:10
 
 export function findNearestBirds(bird: Bird, flock: Flock, limit = 5): Bird[] {
   return flock.birds
-    .map((flockBird) => ({
-      ...flockBird,
-      distanceBetweenBirds: Math.sqrt(
-        Math.pow(bird.position.x - flockBird.position.x, 2) +
-          Math.pow(bird.position.y - flockBird.position.y, 2)
-      )
-    }))
+    .map(() => undefined)
     .sort((a, b) => (a.distanceBetweenBirds < b.distanceBetweenBirds ? -1 : 1))
     .slice(0, limit)
killedBy: position.helper findNearestBird find nearest birds
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ObjectLiteral
src/composables/position.helper.ts:19:26
 
 export function findNearestBirds(bird: Bird, flock: Flock, limit = 5): Bird[] {
   return flock.birds
-    .map((flockBird) => ({
-      ...flockBird,
-      distanceBetweenBirds: Math.sqrt(
-        Math.pow(bird.position.x - flockBird.position.x, 2) +
-          Math.pow(bird.position.y - flockBird.position.y, 2)
-      )
-    }))
+    .map((flockBird) => ({}))
     .sort((a, b) => (a.distanceBetweenBirds < b.distanceBetweenBirds ? -1 : 1))
     .slice(0, limit)
killedBy: position.helper findNearestBird find nearest birds
statusReason: expected [ undefined, undefined ] to strictly equal [ '1', '3' ]

[Killed] ArithmeticOperator
src/composables/position.helper.ts:22:9
     .map((flockBird) => ({
       ...flockBird,
       distanceBetweenBirds: Math.sqrt(
-        Math.pow(bird.position.x - flockBird.position.x, 2) +
-          Math.pow(bird.position.y - flockBird.position.y, 2)
+        Math.pow(bird.position.x - flockBird.position.x, 2) - Math.pow(bird.position.y - flockBird.position.y, 2)
       )
     }))
killedBy: position.helper findNearestBird find nearest birds
statusReason: expected [ '1', '2' ] to strictly equal [ '1', '3' ]

[Killed] ArithmeticOperator
src/composables/position.helper.ts:22:18
     .map((flockBird) => ({
       ...flockBird,
       distanceBetweenBirds: Math.sqrt(
-        Math.pow(bird.position.x - flockBird.position.x, 2) +
+        Math.pow(bird.position.x + flockBird.position.x, 2) +
           Math.pow(bird.position.y - flockBird.position.y, 2)
       )
killedBy: position.helper findNearestBird find nearest birds
statusReason: expected [ '2', '4' ] to strictly equal [ '1', '3' ]

[Killed] ArithmeticOperator
src/composables/position.helper.ts:23:20
       ...flockBird,
       distanceBetweenBirds: Math.sqrt(
         Math.pow(bird.position.x - flockBird.position.x, 2) +
-          Math.pow(bird.position.y - flockBird.position.y, 2)
+          Math.pow(bird.position.y + flockBird.position.y, 2)
       )
     }))
killedBy: position.helper findNearestBird find nearest birds
statusReason: expected [ '2', '3' ] to strictly equal [ '1', '3' ]

[Killed] UnaryOperator
src/composables/position.helper.ts:26:72
           Math.pow(bird.position.y - flockBird.position.y, 2)
       )
     }))
-    .sort((a, b) => (a.distanceBetweenBirds < b.distanceBetweenBirds ? -1 : 1))
+    .sort((a, b) => (a.distanceBetweenBirds < b.distanceBetweenBirds ? +1 : 1))
     .slice(0, limit)
 }
killedBy: position.helper findNearestBird find nearest birds
statusReason: expected [ '1', '2' ] to strictly equal [ '1', '3' ]

[Killed] EqualityOperator
src/composables/position.helper.ts:26:22
           Math.pow(bird.position.y - flockBird.position.y, 2)
       )
     }))
-    .sort((a, b) => (a.distanceBetweenBirds < b.distanceBetweenBirds ? -1 : 1))
+    .sort((a, b) => (a.distanceBetweenBirds >= b.distanceBetweenBirds ? -1 : 1))
     .slice(0, limit)
 }
killedBy: position.helper findNearestBird find nearest birds
statusReason: expected [ '2', '4' ] to strictly equal [ '1', '3' ]

[Killed] BlockStatement
src/composables/position.helper.ts:30:57
     .slice(0, limit)
 }
 
-export function averageDirection(birds: Bird[]): number {
-  if (birds.length === 0) return 0
-  return birds.reduce((acc, b) => (acc += b.direction), 0) / birds.length
-}
+export function averageDirection(birds: Bird[]): number {}
 
killedBy: position.helper averageDirection find average direction of group of birds
statusReason: expected undefined to strictly equal 45

[Killed] ConditionalExpression
src/composables/position.helper.ts:31:7
 }
 
 export function averageDirection(birds: Bird[]): number {
-  if (birds.length === 0) return 0
+  if (true) return 0
   return birds.reduce((acc, b) => (acc += b.direction), 0) / birds.length
 }
killedBy: position.helper averageDirection find average direction of group of birds
statusReason: expected +0 to strictly equal 45

[Killed] EqualityOperator
src/composables/position.helper.ts:31:7
 }
 
 export function averageDirection(birds: Bird[]): number {
-  if (birds.length === 0) return 0
+  if (birds.length !== 0) return 0
   return birds.reduce((acc, b) => (acc += b.direction), 0) / birds.length
 }
killedBy: position.helper averageDirection find average direction of group of birds
statusReason: expected +0 to strictly equal 45

[Killed] AssignmentOperator
src/composables/position.helper.ts:32:36
 
 export function averageDirection(birds: Bird[]): number {
   if (birds.length === 0) return 0
-  return birds.reduce((acc, b) => (acc += b.direction), 0) / birds.length
+  return birds.reduce((acc, b) => (acc -= b.direction), 0) / birds.length
 }
 
killedBy: position.helper averageDirection find average direction of group of birds
statusReason: expected -45 to strictly equal 45

[Killed] ArrowFunction
src/composables/position.helper.ts:32:23
 
 export function averageDirection(birds: Bird[]): number {
   if (birds.length === 0) return 0
-  return birds.reduce((acc, b) => (acc += b.direction), 0) / birds.length
+  return birds.reduce(() => undefined, 0) / birds.length
 }
 
killedBy: position.helper averageDirection find average direction of group of birds
statusReason: expected NaN to strictly equal 45
